# Series

In [1]:
import pandas as pd

In [9]:
x = [3,434,53,42]

var = pd.Series(x, index = ['a', 'b' , 'c' , 'd'] , dtype = 'float', name = 'Python')
print(var)
print(type(var))
print(var[2])

a      3.0
b    434.0
c     53.0
d     42.0
Name: Python, dtype: float64
<class 'pandas.core.series.Series'>
53.0

C:\Users\anshu\AppData\Local\Temp\ipykernel_11204\3621566571.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(var[2])

In [11]:
dictionary = {
    'name' : ['python' , 'java ', 'c' , 'html'],
    'rank' : [1 , 2 , 3 ,4 ],
    'power' : [100 , 200, 100 ,9999]
}

var1 = pd.Series(dictionary)
print(var1)

name     [python, java , c, html]
rank                 [1, 2, 3, 4]
power       [100, 200, 100, 9999]
dtype: object

In [13]:
s = pd.Series(12 , index = [1,2,3,4,5])
print(s)

1    12
2    12
3    12
4    12
5    12
dtype: int64

In [14]:
s1 = pd.Series(12 , index = [1,2,3,4,5,6,7,8,9])
s2 = pd.Series(12 , index = [1,2,3,4,5])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5    24.0
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

# DataFrame

In [20]:
import pandas as pd
l = [1,2,3,4,5,6]

var = pd.DataFrame(l)

print(type(var))
print(var)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5
5  6

In [21]:
var = pd.DataFrame({'A': [1,2,3,4,5] , 'B' : [6,7,8,9,10]})

print(var)

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [23]:
var['C'] = var['A'] + var['B']

print(var)

   A   B   C
0  1   6   7
1  2   7   9
2  3   8  11
3  4   9  13
4  5  10  15

In [25]:
var['D'] = var['A'] - var['B']

print(var)

   A   B   C  D
0  1   6   7 -5
1  2   7   9 -5
2  3   8  11 -5
3  4   9  13 -5
4  5  10  15 -5

In [32]:
var['E'] = var['A'] / var['B']

print(var)

   A   B   C  D         E   f   F
0  1   6   6 -5  0.166667   6   6
1  2   7  14 -5  0.285714  14  14
2  3   8  24 -5  0.375000  24  24
3  4   9  36 -5  0.444444  36  36
4  5  10  50 -5  0.500000  50  50

In [43]:
var['F'] = var['A'] * var['B']

print(var)

   A  Python   B   F
0  1       1   6   6
1  2       2   7  14
2  3       3   8  24
3  4       4   9  36
4  5       5  10  50

# Insert and Delete??

In [41]:
# var.insert(index,column_name,Data_insert)
var1 = pd.DataFrame({'A': [1,2,3,4,5] , 'B' : [6,7,8,9,10]})

var1.insert(1,"Python",var['A'])

var1

   A  Python   B
0  1       1   6
1  2       2   7
2  3       3   8
3  4       4   9
4  5       5  10

In [44]:
var

   A  Python   B   F
0  1       1   6   6
1  2       2   7  14
2  3       3   8  24
3  4       4   9  36
4  5       5  10  50

In [ ]:
var.pop('F')  #  F delete ho gya

0     6
1    14
2    24
3    36
4    50
Name: F, dtype: int64

In [46]:
var

   A  Python   B
0  1       1   6
1  2       2   7
2  3       3   8
3  4       4   9
4  5       5  10

# Write CSV

In [50]:
dis = {'a': [2,5,2,63,53,754,324,23], 's': [234,43,243,33,33,34,3424,23], 'd': [22,543,23,563,253,754,3224,223]}

d = pd.DataFrame(dis)

print(d)


d.to_csv("test_new.csv" , index = False , header=[1,2,3])

     a     s     d
0    2   234    22
1    5    43   543
2    2   243    23
3   63    33   563
4   53    33   253
5  754    34   754
6  324  3424  3224
7   23    23   223

In [52]:
import pandas as pd
import numpy as np
import random

# Set a seed so the random numbers are the same every time
np.random.seed(42)

num_rows = 1000

data = {
    'Employee_ID': range(1, num_rows + 1),
    'Department': np.random.choice(['HR', 'Engineering', 'Sales', 'Marketing'], num_rows),
    'Age': np.random.randint(22, 60, num_rows),
    'Salary': np.random.randint(40000, 150000, num_rows),
    'Years_Experience': np.random.randint(0, 20, num_rows),
    'Performance_Score': np.random.uniform(1.0, 5.0, num_rows).round(1)
}

df = pd.DataFrame(data)

df.to_csv('large_employee_data.csv', index=False)
print(f"File 'large_employee_data.csv' created with {num_rows} rows.")

File 'large_employee_data.csv' created with 1000 rows.

In [53]:
df.head()

   Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
0            1      Sales   38   77412                 3                3.2
1            2  Marketing   30   42920                 1                4.1
2            3         HR   54  131194                17                1.8
3            4      Sales   41  100315                18                3.9
4            5      Sales   34  119561                18                3.5

In [54]:
df.tail()

     Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
995          996         HR   39   56087                 4                1.8
996          997         HR   27   88868                19                1.0
997          998  Marketing   39   63225                17                1.2
998          999  Marketing   40  135286                10                4.6
999         1000      Sales   43   46643                14                3.6